DIACRITICS_MAP = {
    "FOR_DELETION": [
        '់', '៉', '៊', '៍', '័', '៎', '៑', '្', '៏', '៌', 'ៈ',
    ],
    "FOR SUBSTITUTION": {
        '៉': '៊',
        '៊': '៉',
        '៍': '៏',
        '៏': '៍',
        '៍': '៌',
        '៌': '៍',
        '៊': '៑',
        '៑': '៊',
        '្យ': '្ស',
        '្ស': '្យ',
        '្ធ': '្វ',
        '្វ': '្ធ',
        'ៈ': 'ះ',
        'ះ': 'ៈ',
        '្ង': '្ញ',
        '្ញ': '្ង',
        'ំ': 'ុំ',
        'ុំ': 'ំ',
        '្ប': '្ឃ',
        '្ឃ': '្ប',
        '្ក': '្គ',
        '្គ': '្ក',
        '្ផ': '្ជ',
        '្ជ': '្ផ',
        '្ថ': '្ត',
        '្ត': '្ថ',
        '្ច': '្ទ',
        '្ទ': '្ច',
        'ូ': 'ួ',
        'ួ': 'ូ',
        '្ក': '្ត',
        '្ត': '្ក',
        




       




    }
}
